package models

import "time"

// GitRole is roles of accessing to git repositories
//
// Owner :  دسترسی تام به تمام سورس و تمام عملیات ممکن
//
// Master: مجاز به اجرای تمامی دستورات گیت در تمام شاخه ها است.
// این کاربر دسترسی به تنظیمات پروژه ندارد
// و فقط در سطح سورس کد دسترسی تام به دستورات گیت
// در تمام شاخه ها از جمله مستر را دارد
//
// Developer: توسعه دهنده سیستم است که تمامی دستورات گیت را در شاخه ی غیر از مستر میتواند اجرا کند
//
// Reporter: تنها اجازه ی دیدن سورس کد را دارد و امکان هیچ ویرایشی برای وی وجود ندارد
//و هیچ دستور گیتی برای او مجاز نیست
//این کاربر نمیتواند سورس را دانلود کند مگر اینکه پروژه عمومی باشد
//تنها رسیدگی به مسائل مطرحی در پروژه را بر عهده دارد
//
// Guest: تنها اجازه ی دیدن سورس کد را دارد و امکان هیچ ویرایشی برای وی وجود ندارد مگر در پروژه های عمومی
type GitRole struct {
	ID        uint
	Name      string
	CreatedAt time.Time
	UpdatedAt time.Time
	DeletedAt *time.Time
}
